woodyRocket/stm32f103c6-coursework/Lab 1/src/ex6/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define ONE_HR_Pin GPIO_PIN_4
#define ONE_HR_GPIO_Port GPIOA
#define TWO_HR_Pin GPIO_PIN_5
#define TWO_HR_GPIO_Port GPIOA
#define THREE_HR_Pin GPIO_PIN_6
#define THREE_HR_GPIO_Port GPIOA
#define FOUR_HR_Pin GPIO_PIN_7
#define FOUR_HR_GPIO_Port GPIOA
#define SEG_A_Pin GPIO_PIN_0
#define SEG_A_GPIO_Port GPIOB
#define SEG_B_Pin GPIO_PIN_1
#define SEG_B_GPIO_Port GPIOB
#define SEG_C_Pin GPIO_PIN_2
#define SEG_C_GPIO_Port GPIOB
#define FIVE_HR_Pin GPIO_PIN_8
#define FIVE_HR_GPIO_Port GPIOA
#define SIX_HR_Pin GPIO_PIN_9
#define SIX_HR_GPIO_Port GPIOA
#define SEVEN_HR_Pin GPIO_PIN_10
#define SEVEN_HR_GPIO_Port GPIOA
#define EIGHT_HR_Pin GPIO_PIN_11
#define EIGHT_HR_GPIO_Port GPIOA
#define NINE_HR_Pin GPIO_PIN_12
#define NINE_HR_GPIO_Port GPIOA
#define TEN_HR_Pin GPIO_PIN_13
#define TEN_HR_GPIO_Port GPIOA
#define ELEVEN_HR_Pin GPIO_PIN_14
#define ELEVEN_HR_GPIO_Port GPIOA
#define TWELVE_HR_Pin GPIO_PIN_15
#define TWELVE_HR_GPIO_Port GPIOA
#define SEG_D_Pin GPIO_PIN_3
#define SEG_D_GPIO_Port GPIOB
#define SEG_E_Pin GPIO_PIN_4
#define SEG_E_GPIO_Port GPIOB
#define SEG_F_Pin GPIO_PIN_5
#define SEG_F_GPIO_Port GPIOB
#define SEG_G_Pin GPIO_PIN_6
#define SEG_G_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

#define ANALOG_CLOCK_NUMBER			12
#define ENABLE						RESET
#define DISABLE						SET

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
